# AdditionalOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathReinforcement..::..AdditionalOffset Property
PathReinforcement Class See Also
---
Additional offset of rebars in the Path Reinforcement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double AdditionalOffset { get; set; }
```

Visual Basic
---
```text
Public Property AdditionalOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AdditionalOffset {
	double get ();
	void set (double value);
}
```

# Remarks
The method moves both primary and alternating bars.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for offset must be no more than 30000 feet in absolute value. |

# See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace